{
    "GA1_Q1": "Download and unzip the file sample.zip. It contains a CSV file. What is the total number of rows in the file?",
    "GA1_Q2": "Parse the JSON file located in data.json. What is the value associated with the key 'total_users'?",
    "GA1_Q3": "Inspect the HTML file and extract all hyperlinks. How many unique domains are there?",
    "GA1_Q4": "Read the Markdown file report.md and count the number of level-2 headings.",
    "GA1_Q5": "Using the file chart.png, extract its dimensions. What is the aspect ratio (width divided by height)?",
    "GA1_Q6": "Open the XML file. How many unique tag names are present?",
    "GA1_Q7": "Identify hidden elements in the HTML file using browser DevTools. What is the value inside the hidden <div>?",
    "GA1_Q8": "Scan the JavaScript file and identify the number of defined functions.",
    "GA1_Q9": "Inspect the image embedded in a base64 string inside an HTML file. What is its resolution?",
    "GA1_Q10": "Analyze the CSS file and find out how many unique class selectors it defines.",
    "GA2_Q1": "Write documentation in Markdown for an imaginary step-tracking analysis. Include headings, tables, images, links, and code blocks.",
    "GA2_Q2": "Download the provided image. Compress it losslessly to less than 1,500 bytes. Submit the file.",
    "GA2_Q3": "Publish a GitHub Pages portfolio. Ensure your email is embedded inside a special comment.",
    "GA2_Q4": "Run a Google Colab notebook to extract your email using OAuth. What is the final hash value?",
    "GA2_Q5": "Fix the image-processing code in Google Colab and count the number of light pixels.",
    "GA2_Q6": "Deploy a FastAPI-based API to Vercel that reads marks from a JSON file and returns selected student marks by name.",
    "GA2_Q7": "Create a GitHub Action that contains your email in a step and runs on push or manually.",
    "GA2_Q8": "Push a container image to Docker Hub with a tag that includes your email or student ID.",
    "GA2_Q9": "Write a FastAPI server that serves data from a CSV and supports filtering by query parameters.",
    "GA2_Q10": "Download and run a local LLM using Llamafile. Submit the response to a specific prompt.",
    "GA3_Q1": "Use a pre-trained LLM to answer a simple math or reasoning question. What is the output?",
    "GA3_Q2": "Summarize a paragraph of text using a transformer-based summarization model. What is the summary?",
    "GA3_Q3": "Perform sentiment analysis on given text using a HuggingFace model. Is the sentiment positive or negative?",
    "GA3_Q4": "Extract named entities from a provided news article using spaCy or transformers.",
    "GA3_Q5": "Use a language model to generate text that continues a given sentence. What is the first generated sentence?",
    "GA3_Q6": "Use the OpenAI API to rephrase a sentence in simpler language. What is the rephrased result?",
    "GA3_Q7": "Download a model checkpoint from HuggingFace Hub and run a masked word prediction. What is the filled-in word?",
    "GA3_Q8": "Use langchain or transformers to build a basic chatbot. What is the bot's reply to 'What’s your name?'?",
    "GA3_Q9": "Fine-tune a language model with provided custom data. What is the accuracy after training?",
    "GA3_Q10": "Explain how a decoder-only transformer differs from an encoder-decoder architecture in 2 lines."  ,
    "GA4_Q1": "Download the provided CSV file and count the number of missing values in the 'age' column.",
    "GA4_Q2": "Use requests or Selenium to scrape a table from a given webpage. How many rows are present?",
    "GA4_Q3": "Query a public API to retrieve a list of movies released in 2023. How many were retrieved?",
    "GA4_Q4": "Extract text from a given PDF file. How many words does it contain?",
    "GA4_Q5": "Download a ZIP file of images and count how many images are in grayscale.",
    "GA4_Q6": "Read a JSON file from a URL and return the total number of keys at the root level.",
    "GA4_Q7": "Fetch the latest 5 articles from a blog's RSS feed. What is the title of the most recent article?",
    "GA4_Q8": "Read data from a Google Sheet using an API key. What is the value in cell B2?",
    "GA4_Q9": "Use BeautifulSoup to extract all <h2> headings from an HTML file. How many are there?",
    "GA4_Q10": "Download and parse a large JSON file. What is the value of the 'status' field for the last object?",
    "GA5_Q1": "Clean a CSV file by removing rows with missing values and save the result. How many rows remain?",
    "GA5_Q2": "Normalize a column of numeric values between 0 and 1. What is the new minimum value?",
    "GA5_Q3": "Detect and remove duplicate rows from a dataset. How many duplicates were removed?",
    "GA5_Q4": "Read a CSV file and convert all column names to lowercase. What is the name of the third column?",
    "GA5_Q5": "Parse a partial JSON string and fix any errors. What is the corrected value of the 'status' key?",
    "GA5_Q6": "Group the data by 'department' and calculate the average 'salary'. What is the average salary for 'HR'?",
    "GA5_Q7": "Drop columns that have more than 50% missing values. How many columns remain?",
    "GA5_Q8": "Split a full name column into first and last names. What is the last name in the 5th row?",
    "GA5_Q9": "Convert a date column to datetime format and extract the year. What year appears most frequently?",
    "GA5_Q10": "Apply a one-hot encoding to a 'gender' column. How many new columns are added?"
  }
  
  

  
  
  